# Generic Zone Perimeter Property

Source: https://www.revitapidocs.com/2026/79434f59-176f-e622-5983-0dddcddd9595.htm

---

| Generic Zone Perimeter Property |
| --- |

The perimeter for the zone, in feet.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double Perimeter { get; }
```

```
Public ReadOnly Property Perimeter As Double
	Get
```

```
public:
property double Perimeter {
	double get ();
}
```

```
member Perimeter : float with get
```

#### Property Value

Double See Also

#### Reference

GenericZone Class Autodesk.Revit.DB.Analysis Namespace